# Еженедельные события с привязкой к дню недели
event_day_time = {
    "Битва за Даскшир": (
        (1, "16:00"),  # Вторник в 16:00
        (3, "16:00"),  # Четверг в 16:00
        (5, "16:00"),  # Суббота в 16:00
        (6, "19:00"),  # Воскресенье в 19:00
        (0, "19:00"),  # Понедельник в 19:00
        (2, "19:00"),  # Среда в 19:00
        (4, "19:00"),  # Пятница в 19:00
        (1, "22:30"),  # Вторник в 22:30
        (3, "22:30"),  # Четверг в 22:30
        (5, "22:30"),  # Суббота в 22:30
    ),
    "Битва за зачарованные Пруды": (
        (6, "16:00"),  # Воскресенье в 16:00
        (0, "16:00"),  # Понедельник в 16:00
        (2, "16:00"),  # Среда в 16:00
        (4, "19:00"),  # Пятница в 19:00
        (1, "19:00"),  # Вторник в 19:00
        (3, "19:00"),  # Четверг в 19:00
        (5, "19:00"),  # Суббота в 19:00
        (6, "22:30"),  # Воскресенье в 22:30
        (0, "22:30"),  # Понедельник в 22:30
        (2, "22:30"),  # Среда в 22:30
        (4, "22:30"),  # Пятница в 22:30
    )
}

# События, которые происходят каждый день в одно и то же время
event_all_day = {
    "Логово Дракона": (
        "13:20",
        "18:20",
        "21:20"
    ),
    "Последний день Ирамканда": (
        "12:00",
        "17:00",
        "20:00"
    )
}
